appcomponents/modules/passport/models/UserModel.php

SELECT COUNT(*) FROM `3d_user` WHERE `id` IN ('3', '3', '9', '9', '3')
---
    public static function getCount($params, $fied=['*']) {
        try {
            $query = self::find()->select($fied);
            if(!empty($params)) {
                foreach($params as $k=>$v) {
                    if(is_array($v)) {
                        $query -> andWhere($v);
                    } else {
                        $query -> andWhere([$k=>$v]);
                    }
                }
            }
//                return $query->createCommand()->getRawSql();
            return  $query->count();